{
	"about": {
		"iam": "Ik ben een software engineer die gespecialiseerd is in het bouwen van Web API's, maar af en toe hou ik me ook bezig met het ontwerpen van graphical user interfaces. Ik studeer Informatica aan Avans hogeschool en werk ik aan een aantal technische projecten om mijn programeervaardigheden te verbeteren.",
		"intro": "Hallo mijn naam is",
		"someTech": "Hier zijn een paar technologieën waar ik recentelijk mee heb gewerkt"
	},
	"dropdown": {
		"more": "meer",
		"noResults": "geen resultaten",
		"search": "Zoeken",
		"select": "Selecteer"
	},
	"info": {
		"firebaseDataCollection": "Deze website gebruikt Google Analytics voor het verzamelen van data over hoe de website wordt gebruikt",
		"welcome": "Hallo! <br> Is het scherm te donker? klik op de draaiende planeet voor een light mode"
	},
	"input": {
		"cancel": "Annuleren",
		"confirm": "Bevestigen",
		"dark-theme": "dark theme",
		"light-theme": "light theme",
		"required": "Is verplicht"
	},
	"language": {
		"select": "Taal Selecteren"
	},
	"projects": {
		"auth": {
			"content": "Het doel van dit project was om te leren hoe OAuth 2.0 en OpenId met Identityserver 4 in .NET werken. Dit project is geïmplementeerd met een clean (onion) architectuur en heeft een gebruiksvriendelijke interface voor alle authenticatiebehoeften voor elk project, met de mogelijkheid om JWT te structureren zoals dat uitkomt. <br/> De Api verzorgd: <br/><br/> <ul> <li>Registreren van applicaties en gebruikers </li> <li>Authenticatie en autorisatie </li> <li>Wachtwoorden bijwerken </li> <li>Reset en recover wachtwoord </li> <li>E-mails verzenden </li> <li>Refresh tokens</li> </ul>",
			"title": "Single sign-on"
		},
		"deeplearning": {
			"content": "Het doel van dit project was om te leren hoe de wiskunde in neuraal netwerk werkt en hoe je de lagen in een neuraal netwerk kan opbouwen. Dit leerdoel was onderdeel van mijn minor data science, waar ik o.a. een neuraal netwerk voor handschriftherkenning heb gemaakt op basis van een onderzoekspaper van Graves A. & Schmidhuber J. genaamd <a href='https://people.idsia.ch/~juergen/nips2009.pdf' target='_blank'>Offline Handwriting Recognition with Multidimensional Recurrent Neural Networks</a>",
			"title": "Handwriting Recognition"
		},
		"didac": {
			"content": "Het doel van dit project is om een app te bouwen die mijn eerdere projecten Handwriting recognition, Single sign-on and the Email Service in een microservice-architectuur onderbrengt, die wordt onderhouden met Kubernetes. Met deze app kunnen gebruikers flash-kaarten maken, configureren, leren en delen. De tijd tussen het leren van flashcards is gebaseerd op de leercurve van de gebruiker die aan de kaart is gekoppeld. De leercurve wordt berekend met het <a href='https://www.supermemo.com/en/archives1990-2015/english/ol/sm2' target='_blank'> SuperMemo 2 spaced repetition algorithm </a> en hangt af van de feedback die aan de kaart wordt gegeven en de tijd die nodig is om de flashcard te beantwoorden. Verder geeft de app inzicht in de leerretentie van gebruikers met leaderboards en datavisualisatie. ",
			"title": "Leraar Didac"
		},
		"email": {
			"content": "Het doel van dit project was om een ​​API te bouwen voor het verzenden van e-mails ontworpen met HTML en CSS, met een gebruiksvriendelijke interface voor allerlei soorten projecten.",
			"title": "E-mail Service"
		},
		"task": {
			"content": "Met dit project kunnen gebruikers in een team een kanbanbord bouwen. Wijzigingen die door één gebruiker zijn gemaakt, worden in realtime weergegeven aan andere gebruikers in hetzelfde team. Taken kunnen worden georganiseerd in sprints en de voortgang kan gevolgd worden met een burn-downgrafiek.",
			"title": "Real Time Task Manager"
		},
		"voice": {
			"content": "Met dit project kunnen gebruikers een HTTP-verzoek met queryparameters configureren en die configuratie koppelen aan een spraakopdracht. Als je bijvoorbeeld een API hebt die het licht in meerdere kamers kan aanzetten, dan kan je een audiobestand naar de Voice Control API sturen met de tekst \"zet het licht aan in kamer A\", en de Voice Control API stuurt een HTTP-verzoek naar die API die de lampen aanstuurt met ‘kamer A' als queryparamater.",
			"title": "Voice Control API's"
		}
	},
	"signpost": {
		"checkGithub": "Check Github",
		"checkProjects": "Bekijk een paar van mijn projecten",
		"home": "Home",
		"projects": "Projecten",
		"techStack": "Technology Stack"
	}
}